{
    "version": "https://jsonfeed.org/version/1",
    "title": "Becoming Embedded Freelancer",
    "description": "",
    "home_page_url": "https://freelancer.rosmianto.com",
    "feed_url": "https://freelancer.rosmianto.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "rosmianto"
    },
    "items": [
        {
            "id": "https://freelancer.rosmianto.com/i-want-to-be-a-freelancer-working-on-embedded-projects-but-i-dont-know-how.html",
            "url": "https://freelancer.rosmianto.com/i-want-to-be-a-freelancer-working-on-embedded-projects-but-i-dont-know-how.html",
            "title": "Unlock multiple income streams as an embedded engineer, by becoming an embedded freelancer.",
            "summary": "Learn how to earn more money (even more than your main job) working on freelance projects using a proven path&hellip;",
            "content_html": "<p>Learn how to earn more money (even more than your main job) working on freelance projects using a proven path explained from an embedded engineer's point-of-view.</p>\n<p><a href=\"https://drive.google.com/file/d/1hBFDE-ca5tZGSUiOttQWxU2eoATpxoti/view?usp=sharing\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"btn plausible-event-name=Preview-Click\">Get two free chapters</a> <a href=\"#buy-anchor\" class=\"btn btn--white\">Buy now</a></p>\n<p> </p>\n<h3 class=\"align-center\">\"I want to be a freelancer working on embedded projects, but I don't know how.\"</h3>\n<p>Hi! I'm <a href=\"https://www.linkedin.com/in/rosmianto/\" target=\"_blank\" rel=\"noopener noreferrer\">Rosmianto</a>, an embedded systems engineer who used to be stuck with a fragile single stream of income.</p>\n<p>Let me first ask you a question: what is the most common way to make more money as an embedded engineer? Two: <em>promotion</em> or <em>switching companies</em>.</p>\n<p>But promotion isn't straightforward, you can't work twice as hard and expect to be promoted next year. That's not how it works. Promotion is also subject to <em><strong>execs' approval</strong></em>, subject to the <em><strong>company's financial</strong></em> and <em><strong>political situation</strong></em>. Hell, it's even subject to <em><strong>competition from your peers</strong></em> (they also want to be promoted right?).</p>\n<p>Even when you get promoted, how much salary hike you'll get?</p>\n<p>Not even 10% (mine was worse at 5%). That's excluding yearly inflation (around 3% in my country).</p>\n<p>All that for an inflated title and more pressure and stress at work? <strong>No thanks</strong>.</p>\n<p>Fine, you might be tempted to switch companies. Now, the question is: can you find a significantly better company than yours? And can you actually pass their bar?</p>\n<p>Why significantly better? Because, trust me, in many cases switching companies is just trading off one thing with another. Take my case for example, I was working at this company: paid well enough, worked from home, close to my house, had good friends, and no politics.</p>\n<p>If I want to make more money by switching companies, that means I have to find another company with the good things above, plus with better pay. And let me tell you, it's hard. And not straightforward. Most of the time, I need to sacrifice 3 things just to get 1 thing (better pay).</p>\n<p>Also, no thanks.</p>\n<p>I have tried promotion and switching stuff, and honestly those were only my <em>wants</em>, not my <em>needs</em>. What I truly need is just some income boosts.</p>\n<p>Enter: <strong>freelancing world</strong>.</p>\n<p>Let's say you have years of experience in corporate world doing embedded stuff, what if I told you that people around the world are <strong>willing to pay you money</strong> to give them results exactly like you did at work?</p>\n<p>It's like getting paid by multiple bosses <strong>to do the same thing</strong>.</p>\n<p>Your firmware design skills at work? Someone from Korea wants that.</p>\n<p>Or maybe you have the skill to debug CAN bus system? Someone from Germany is desperate to find you, ready to spend $500 to save weeks of unnecessary troubleshooting sessions.</p>\n<p>I knew that was interesting, that's why I tried freelancing from Upwork (for a $12.5 task) to LinkedIn (for $2950 per project). I have to admit that the journey wasn't easy, mostly because I had to figure it out from zero. I've spent too much time doing trial &amp; error since 2019.</p>\n<p>As I grew my freelance business, I quickly realized that we need more and more freelancers especially in embedded systems industry. Why? Wouldn't that increase my competition?</p>\n<p>Well, that's because my focus is low-power design and firmware development. And the clients want more freelancers who know:</p>\n<ul>\n<li>Medical embedded systems</li>\n<li>Automotive (CAN, LIN, Hard real-time RTOS)</li>\n<li>Regulation and standards</li>\n<li>Industrial IoT</li>\n<li>How to write firmware for European Space Agency rocket payload (yes, someone asked me that).</li>\n<li>etc.</li>\n</ul>\n<p>I simply didn't have the time and energy and expertise to cater to all of them.</p>\n<p>That's why I decided to put together what I know about freelancing, the path, the caveats, how to get clients. So you can try freelancing and handle those clients, instead of trying to figure out everything from zero like I did. Do you know this proverb?</p>\n<p class=\"entry-title\"><em>Give a Man a Fish, and You Feed Him for a Day. Teach a Man To Fish, and You Feed Him for a Lifetime.</em></p>\n<p>What I want is to \"Teach a Man (you) to Fish (clients)\". Simple as that.</p>\n<h2>What I've put together</h2>\n<p>When I first started working on this project, my goal was pretty simple: take all of my freelancing content on LinkedIn, bundle it up into one resource, and put it out into the world.</p>\n<p>But as I worked on this book, I added more and more material, it became more than just a book, but more like <strong>a complete starter kit for any embedded engineers to start freelancing</strong>. </p>\n<p>Here's what I ended up with...</p>\n<h2>The Book 📖</h2>\n<p>A compact PDF containing frameworks, tips and tricks, and my freelance stories.</p>\n<p>I deliberately designed this book to be short, because I want you to quickly finish the book and start implementing what's inside.</p>\n<p>It's just 82 pages, so I estimate you can finish it in a day (or two). And start implementing tomorrow.</p>\n<p>I write the chapters to be as independent as possible, so you can read them in any order. And can be re-read as a reference.</p>\n<p>[insert two pages with drop shadows]</p>\n<h2>Proposal &amp; Contract Template 📜</h2>\n<p>The book will teach you a ton, but there are some things best learned by seeing how an actual freelancer does it himself.</p>\n<p>[insert to pages with drop shadows]</p>\n<h2>Development Timetracker Template ⏰</h2>\n<p>Do you think you need fancy software to manage development task list? This template will prove you otherwise. This is an actual spreadsheet I made to track one of my freelance project tasks (complete with the unmodified timestamp).</p>\n<p>[insert the excel screenshot with drop shadows]</p>\n<h2>Progress Update Email Template 📨</h2>\n<p>See how I handled client via email. Weekly progress update email is my way of keeping my progress transparent.</p>\n<p>[insert weekly email screenshot with drop shadows]</p>\n<h2>Project Cost Breakdown Example 💵</h2>\n<p>See how I price a freelance project, down to each task, each time taken, each charged price, to the total development cost.</p>\n<p>[insert spreadsheet cost breakdown with drop shadows]</p>\n<h1 id=\"buy-anchor\" class=\"align-center\">Get Becoming Embedded Freelancer Today.</h1>\n<p class=\"align-center\">Learn how to earn more money (even more than your main job) working on freelance projects using a proven path explained from an embedded engineer's point-of-view.</p>\n<table>\n<tbody>\n<tr>\n<td style=\"width: 50%; vertical-align: top;\" scope=\"row\"><strong>The Essential</strong><br>\n<div class=\"pricing-container\">\n<h1 style=\"display: inline;\">$27 USD</h1>\n<p style=\"display: inline;\">+ local taxes</p>\n</div>\n<p><a href=\"https://rosmianto.lemonsqueezy.com/buy/46196f31-fdc6-43ce-991d-860fcec5110a\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"btn plausible-event-name=Buy-Essential\">Buy now</a></p>\n<br>✔ The <strong>80-page book</strong> in PDF format</td>\n<td style=\"width: 50%; vertical-align: top;\" scope=\"row\"><strong>The Premium Package</strong><br>\n<div class=\"pricing-container\">\n<h1 style=\"display: inline;\">$47 USD</h1>\n<p style=\"display: inline;\">+ local taxes</p>\n</div>\n<p><a href=\"https://rosmianto.lemonsqueezy.com/buy/8d738e50-697c-4266-8e98-3966b7915687\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"btn plausible-event-name=Buy-Premium\">Buy now</a><br><br>✔ The <strong>80-page book</strong> in PDF format<br><strong>✔ Proposal &amp; Contract</strong> Template<br>✔ Development <strong>Timetracker</strong> Template<br>✔ Progress Update <strong>Email</strong> Template<br>✔ Project <strong>Cost Breakdown</strong> Example</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "rosmianto"
            },
            "tags": [
            ],
            "date_published": "2024-08-07T09:11:12+07:00",
            "date_modified": "2024-08-08T13:19:14+07:00"
        }
    ]
}
