{
    "version": "https://jsonfeed.org/version/1",
    "title": "Becoming Embedded Freelancer",
    "description": "",
    "home_page_url": "https://freelancer.rosmianto.com",
    "feed_url": "https://freelancer.rosmianto.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "rosmianto"
    },
    "items": [
        {
            "id": "https://freelancer.rosmianto.com/i-want-to-be-a-freelancer-working-on-embedded-projects-but-i-dont-know-how.html",
            "url": "https://freelancer.rosmianto.com/i-want-to-be-a-freelancer-working-on-embedded-projects-but-i-dont-know-how.html",
            "title": "Unlock multiple streams of income as an embedded engineer, by becoming an embedded freelancer.",
            "summary": "Learn how to earn more money (even more than your main job) working on freelance projects using a proven path&hellip;",
            "content_html": "<p>Learn how to earn more money (even more than your main job) working on freelance projects using a proven path explained from an embedded engineer's point-of-view.</p>\n<p><button type=\"button\">Get two free chapters</button> <button type=\"button\">Buy now</button></p>\n<h3 class=\"align-center\">\"I want to be a freelancer working on embedded projects, but I don't know how.\"</h3>\n<p>Hi! I'm Rosmianto, an embedded systems engineer who used to be stuck with a fragile single stream of income.</p>\n<p>Let me first ask you a question: what is the most generic way to make more money as an embedded engineer? Two: <em>promotion</em> or <em>switching company</em>.</p>\n<p>But promotion isn't straighforward, you can't work twice as hard and expect to be promoted next year. That's not how it works. Promotion is also subject to <em><strong>execs' approval</strong></em>, subject to <em><strong>company financial</strong></em> and <em><strong>political situation</strong></em>. Hell, it's even subject to <em><strong>competition from your peers</strong></em> (they also want to be promoted right?).</p>\n<p>Even when you get promoted, how much salary hike you'll get?</p>\n<p>Not even 10% (mine was worse at 5%). That's excluding yearly inflation (around 3% in my country).</p>\n<p>All that for a inflated title and more pressure and stress at work? <strong>No thanks</strong>.</p>\n<p>Fine, you might be tempted to switch company. Now, the question is: can you find a significantly better company than yours currently? And can you actually pass their bar?</p>\n<p>Why significantly better? Because, trust me, in many cases, switching company is just trading off one thing with another. Take my case for example, I was working at this company: paid good enough, work from home, close from my house, good friends, no politics.</p>\n<p>If I want to make more money by switching company, that means I have to find another company with the good things above, plus with better pay. And let me tell you, it's hard. And not straightforward. Most times I need to sacrifice 3 things just to get 1 thing (better pay).</p>\n<p>Also, no thanks.</p>\n<p>I have tried promotion and switching stuff, and honestly those was only my <em>wants</em>, not my <em>needs</em>. What I truly need is just some income boosts.</p>\n<p>Enter: <strong>freelancing world</strong>.</p>\n<p>It's like getting paid by multiple bosses.</p>\n<p> </p>\n<p>I didn't come from money, I had to support myself in school, I have I crave for financial freedom</p>\n<p>In this book, I want to guide you on how to be a freelancer as an embedded engineer. I will share with you my proven method of doing freelance. I will also share with you my framework you can steal.<br><br>This book isn’t a generic book, I don’t like reading long and tedious books, because they’re boring.<br><br>So in this book, I try my hardest to pack all the value I can share into this book, as compact as possible, without much fluffs and introduction bullshit.<br><br>In other words, I designed this book precisely to be to-the-point, zero bullshit, meat-only content, so you can extract my knowledge in this book as fast as possible. And thus, make money as a freelancer as soon as possible.</p>\n<p><br>Ready?</p>",
            "author": {
                "name": "rosmianto"
            },
            "tags": [
            ],
            "date_published": "2024-08-07T09:11:12+07:00",
            "date_modified": "2024-08-07T13:20:22+07:00"
        }
    ]
}
